<template>
  <div>
    <section class="hero">
      <h1 class="sr-only">Test - Blog Details Page</h1>

      <img src="@/assets/images/article-01-main.jpg" alt="" class="hero__bg" />

      <div class="hero__container container">
        <div class="hero__wrap">
          <ArticleDetailsHeroCard class="hero__card" />
        </div>
      </div>
    </section>

    <section class="section-article">
      <div class="section-article__container container container--sm">
        <div class="section-article__wrap">
          <ul class="section-article__tags">
            <li>
              <ArticleTag>COVID-19</ArticleTag>
            </li>
            <li>
              <ArticleTag>Повернення коштів</ArticleTag>
            </li>
            <li>
              <ArticleTag>Сертифікати</ArticleTag>
            </li>
          </ul>

          <div class="text-block">
            <p>
              Друзі, ми запроваджуємо можливість не втратити свої кошти в разі захворювання на
              COVID-19 або введення обмежень на подорожі пов'язаних із пандемією.
            </p>

            <p>
              Зверніть увагу, що ви отримуєте право на відмову від участі у заброньованій подорожі
              чи зміну дат подорожі із повним збереженням коштів, не зважаючи на наші основні
              правила та терміни скасування бронювань, якщо перед початком подорожі ви отримали
              позитивний лабораторний ПЛР/антиген тест.
            </p>

            <p>
              Ми повернемо вам Організаційний збір у розмірі 90% або перенесемо в повному обсязі на
              інші дати або іншу подорож після вашого одужання. Для підтвердження потрібно
              пред'явити позитивний лабораторний ПЛР/антиген тест, зроблений не раніше ніж за 10 діб
              до початку мандрівки. Виключенням є додаткові послуги придбані в третіх контрагентів
              (наприклад квитки на літак, потяг, пором, музейні квитки), які повертаються або
              переносяться в межах правил, визначених даними контрагентами (авіакопаніями,
              укрзалізницею і т.д.).
            </p>

            <p>
              Важливо! Якщо ви планували подорож з сім'єю – право на відмову від подорожі чи
              перенесення дат з повним збереженням коштів отримує вся сім’я першого ступеня
              спорідненості.
            </p>

            <p>
              Якщо ви планували подорож з друзями чи іншим колективом право на відмову від подорожі
              чи зміною дат подорожі зі збереженням коштів мають право лише Учасники із позитивним
              лабораторним ПЛР/антиген тестом.
            </p>

            <p>
              Якщо, на вашу думку, ви контактували із хворим на Коронавірусну хвороба (COVID-19), то
              для відмови від участі у заброньованій подорожі чи зміну дат подорожі із повним
              збереженням коштів вам все ж необхідно зробити лабораторний ПЛР/антиген тест. Якщо
              тест негативний – поїхали!))
            </p>

            <p>
              В разі, якщо запланована подорож не може відбутись по причині обмежень, введених
              урядом або іншими уповноваженими органами, ми повернемо або перенесемо кошти у повному
              обсязі, на вибір учасника. Виключенням є послуги придбані в третіх контрагентів
              (наприклад квитки на літак, потяг), які повертаються або переносяться в межах правил,
              визначених даними контрагентами (авіакопаніями, укрзалізницею).
            </p>

            <p>
              В будь якому разі, при перших підозрах на коронавірус, будь ласка, звертайтесь до
              Організаторів. Нагадуємо, що також:
            </p>

            <ul>
              <li>
                ви маєте можливість перепродати свої місця на подорож із особисто вами визначеною
                сумою знижки (#швидкаваліза) і ми вам в цьому всіляко посприяємо.
              </li>

              <li>
                на вашому місці можуть поїхати рідні, близькі, друзі, які не контактували з хворою
                людиною та не мають ознак хвороби.
              </li>
            </ul>

            <p>
              <img src="@/assets/images/article-01-01.jpg" alt="" />
            </p>

            <p>
              Друзі, ми запроваджуємо можливість не втратити свої кошти в разі захворювання на
              COVID-19 або введення обмежень на подорожі пов'язаних із пандемією.
            </p>

            <p>
              Зверніть увагу, що ви отримуєте право на відмову від участі у заброньованій подорожі
              чи зміну дат подорожі із повним збереженням коштів, не зважаючи на наші основні
              правила та терміни скасування бронювань, якщо перед початком подорожі ви отримали
              позитивний лабораторний ПЛР/антиген тест.
            </p>

            <p>
              Ми повернемо вам Організаційний збір у розмірі 90% або перенесемо в повному обсязі на
              інші дати або іншу подорож після вашого одужання. Для підтвердження потрібно
              пред'явити позитивний лабораторний ПЛР/антиген тест, зроблений не раніше ніж за 10 діб
              до початку мандрівки. Виключенням є додаткові послуги придбані в третіх контрагентів
              (наприклад квитки на літак, потяг, пором, музейні квитки), які повертаються або
              переносяться в межах правил, визначених даними контрагентами (авіакопаніями,
              укрзалізницею і т.д.).
            </p>

            <p>
              <img src="@/assets/images/article-01-02.jpg" alt="" />
            </p>
          </div>
        </div>
      </div>
    </section>

    <section class="section">
      <div class="section__container container">
        <div class="section__wrap">
          <div class="section__header">
            <h2 class="section__title">Подібні статті</h2>
          </div>

          <div class="section__body">
            <div class="section__slider-wrap">
              <Swiper
                :modules="[SwiperNavigation]"
                :slides-per-view="1"
                :space-between="12"
                :speed="800"
                :breakpoints="{
                  '560': {
                    slidesPerView: 2,
                    spaceBetween: 12,
                  },
                  '1024': {
                    slidesPerView: 3,
                    spaceBetween: 12,
                  },
                }"
                :navigation="true"
              >
                <SwiperSlide v-for="num in 5" :key="num">
                  <ArticleCard />
                </SwiperSlide>
              </Swiper>
            </div>
          </div>
        </div>
      </div>
    </section>
  </div>
</template>

<script setup>
import ArticleDetailsHeroCard from '~/components/general/ArticleDetailsHeroCard.vue';
import ArticleCard from '~/components/general/ArticleCard.vue';
import ArticleTag from '~/components/general/ArticleTag.vue';
</script>
